---
title: TextNode
classe: Autodesk.Revit.DB.TextNode
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.RenderNode
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# TextNode

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ BaseDirection { get; }` | `textNode.BaseDirection` | XYZ |
| `Color Color { get; }` | `textNode.Color` | Color |
| `Double FontHeight { get; }` | `textNode.FontHeight` | Double |
| `String FontName { get; }` | `textNode.FontName` | String |
| `Double Height { get; }` | `textNode.Height` | Double |
| `HorizontalTextAlignment HorizontalAlignment { get; }` | `textNode.HorizontalAlignment` | HorizontalTextAlignment |
| `Boolean IsBold { get; }` | `textNode.IsBold` | Boolean |
| `Boolean IsItalic { get; }` | `textNode.IsItalic` | Boolean |
| `Boolean IsKeptReadable { get; }` | `textNode.IsKeptReadable` | Boolean |
| `Boolean IsTransparent { get; }` | `textNode.IsTransparent` | Boolean |
| `Boolean IsUnderlined { get; }` | `textNode.IsUnderlined` | Boolean |
| `XYZ Position { get; }` | `textNode.Position` | XYZ |
| `Double TabSize { get; }` | `textNode.TabSize` | Double |
| `String Text { get; }` | `textNode.Text` | String |
| `XYZ UpDirection { get; }` | `textNode.UpDirection` | XYZ |
| `VerticalTextAlignment VerticalAlignment { get; }` | `textNode.VerticalAlignment` | VerticalTextAlignment |
| `Double Width { get; }` | `textNode.Width` | Double |
| `Double WidthScale { get; }` | `textNode.WidthScale` | Double |
| `FormattedText GetFormattedText()` | `textNode.GetFormattedText()` | FormattedText |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```